In [1]:
%load_ext autoreload
%autoreload 2

In [37]:
import os.path as op
import pandas as pd

file = op.join('../test/sample_data', 'isidro.bedpe')
t = pd.read_csv(file, nrows=2, sep='\t', comment='#', header=None)
t_head = pd.read_csv(file, nrows=2, sep='\t', comment='#', header=None, skiprows=1)
# print(t.dtypes == t_head.dtypes)
# print((t.dtypes == t_head.dtypes).all())
# print(t.dtypes)
# print(t_head.dtypes)
"\t".join(t.head().values[0])

'chrom1\tstart1\tend1\tchrom2\tstart2\tend2\tsv_id\tpe_support\tstrand1\tstrand2\tsvclass\tsvmethod'

In [31]:
t_head.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,8,127310000,127320000,8,127820000,127830000,.,.,.,.,"0,0,150",2,NaN
1,8,127880000,127890000,8,128310000,128320000,.,.,.,.,"0,0,150",2,NaN

In [29]:
file = op.join('../test/sample_data', 'hg19_myc.bedpe')
t = pd.read_csv(file, nrows=2, sep='\t', comment='#', header=None)
t_head = pd.read_csv(file, nrows=2, sep='\t', comment='#', header=None, skiprows=1)
print((t.dtypes == t_head.dtypes).all())
print(t.dtypes)
print(t_head.dtypes)
t.head()

True
0       int64
1       int64
2       int64
3       int64
4       int64
5       int64
6      object
7      object
8      object
9      object
10     object
11      int64
12    float64
dtype: object
0       int64
1       int64
2       int64
3       int64
4       int64
5       int64
6      object
7      object
8      object
9      object
10     object
11      int64
12    float64
dtype: object

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,8,127310000,127320000,8,127820000,127830000,.,.,.,.,"0,0,150",2,NaN
1,8,127880000,127890000,8,128310000,128320000,.,.,.,.,"0,0,150",2,NaN

In [19]:
file = op.join('../test/sample_data', 'hg19_myc.bedpe')
t = pd.read_csv(file, nrows=2, sep='\t', comment='#')
print(t.dtypes)
t.head()

8                int64
127310000        int64
127320000        int64
8.1              int64
127820000        int64
127830000        int64
.               object
..1             object
..2             object
..3             object
0,0,150         object
2                int64
Unnamed: 12    float64
dtype: object

,8,127310000,127320000,8.1,127820000,127830000,.,..1,..2,..3,"0,0,150",2,Unnamed: 12
0,8,127880000,127890000,8,128310000,128320000,.,.,.,.,"0,0,150",2,NaN
1,8,127880000,127890000,8,130550000,130560000,.,.,.,.,"0,0,150",2,NaN